Documents/РегистрацияДвижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>РегистрацияДвижения</Name>
			<BasedOn>
				<xr:Item>Task.ЗадачаИсполнителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДоступа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Посетитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Посетители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвижения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДвиженияДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДоступа</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьПосещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Посетитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Посетители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвижения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДвижения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыДвижения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РегистрацияДвижения/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    // Проверка заполнения обязательных полей
    Если НЕ ЗначениеЗаполнено(ДатаВремя) Тогда
        Сообщить("Не указана дата и время движения!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТипДвижения) Тогда
        Сообщить("Не указан тип движения!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(Пропуск) Тогда
        Сообщить("Не указан пропуск!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(Посетитель) Тогда
        Сообщить("Не указан посетитель!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ЗонаДоступа) Тогда
        Сообщить("Не указана зона доступа!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТочкаКонтроля) Тогда
        Сообщить("Не указана точка контроля!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Инициализация движений
    Движения.ДвиженияДоступа.Записывать = Истина;

    // Проверяем, что пропуск действующий
    СтатусВыдан = Справочники.СтатусыПропусков.НайтиПоНаименованию("Выдан", Истина);
    Если ТипЗнч(Пропуск) <> Тип("ДокументСсылка.ВыдачаПропуска") Тогда
        Сообщить("Пропуск должен быть типа 'ВыдачаПропуска'!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Проверяем соответствие зоны доступа
    Если Пропуск.ЗонаДоступа <> ЗонаДоступа Тогда
        Сообщить("Зона доступа " + ЗонаДоступа + " не соответствует зоне пропуска " + Пропуск.ЗонаДоступа + "!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;  

    // Проверка уникальности движения по регистратору и дате
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1 Период
    |ИЗ РегистрНакопления.ДвиженияДоступа
    |ГДЕ Регистратор = &Регистратор
    |    И НАЧАЛОПЕРИОДА(Период, ДЕНЬ) = &Период";
    Запрос.УстановитьПараметр("Регистратор", Ссылка);
    Запрос.УстановитьПараметр("Период", НачалоДня(Дата));

    Если НЕ Запрос.Выполнить().Пустой() Тогда
        Сообщить("Для документа " + Ссылка + " уже зарегистрировано движение на дату " + Формат(НачалоДня(Дата), "ДЛФ=Д") + "! Повторное создание запрещено.");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Проверка уникальности движения по пропуску, дате и типу движения
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1 Период
    |ИЗ РегистрНакопления.ДвиженияДоступа
    |ГДЕ Пропуск = &Пропуск
    |    И НАЧАЛОПЕРИОДА(Период, ДЕНЬ) = &Период
    |    И ТипДвижения = &ТипДвижения
    |    И Регистратор <> &Регистратор";
    Запрос.УстановитьПараметр("Пропуск", Пропуск);
    Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
    Запрос.УстановитьПараметр("ТипДвижения", ТипДвижения);
    Запрос.УстановитьПараметр("Регистратор", Ссылка);

    Если НЕ Запрос.Выполнить().Пустой() Тогда
        Сообщить("Для пропуска " + Пропуск + " уже зарегистрировано движение типа '" + ТипДвижения + "' на дату " + Формат(НачалоДня(Дата), "ДЛФ=Д") + "! Повторное проведение запрещено.");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Расчет длительности посещения
    ДлительностьПосещения = 0;
    Если ТипДвижения = Перечисления.ТипыДвижения.Выход Тогда
        // Находим последнее движение "Вход" для этого пропуска и точки контроля
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ МАКСИМУМ(ДатаВремя) КАК ПоследнийВход
        |ИЗ РегистрНакопления.ДвиженияДоступа
        |ГДЕ Пропуск = &Пропуск
        |    И ТочкаКонтроля = &ТочкаКонтроля
        |    И ТипДвижения = &ТипВход
        |    И ДатаВремя <= &ДатаВремя
        |    И Регистратор <> &Регистратор"; // Исключаем текущий документ
        Запрос.УстановитьПараметр("Пропуск", Пропуск);
        Запрос.УстановитьПараметр("ТочкаКонтроля", ТочкаКонтроля);
        Запрос.УстановитьПараметр("ТипВход", Перечисления.ТипыДвижения.Вход);
        Запрос.УстановитьПараметр("ДатаВремя", ДатаВремя);
        Запрос.УстановитьПараметр("Регистратор", Ссылка);
        Выборка = Запрос.Выполнить().Выбрать();
        Если Выборка.Следующий() И Выборка.ПоследнийВход <> Null Тогда
            // Расчет длительности на основе полной даты и времени
            ДлительностьПосещения = (ДатаВремя - Выборка.ПоследнийВход) / 60; // В минутах
            Если ДлительностьПосещения < 0 Тогда
                Сообщить("Дата и время выхода не могут быть меньше даты и времени входа!");
                Отказ = Истина;
                Возврат;
            КонецЕсли;
        Иначе
            Сообщить("Для пропуска " + Пропуск + " не найден предыдущий вход через точку контроля " + ТочкаКонтроля + "!");
            Отказ = Истина;
            Возврат;
        КонецЕсли;
    КонецЕсли;

    // Формируем движение
    Движение = Движения.ДвиженияДоступа.Добавить();
    Движение.Период = НачалоДня(Дата); // Устанавливаем Период с обнуленным временем (только дата)
    Движение.ДатаВремя = ДатаВремя; // Полная дата и время
    Движение.Посетитель = Посетитель;
    Движение.ЗонаДоступа = ЗонаДоступа;
    Движение.ТочкаКонтроля = ТочкаКонтроля;
    Движение.ТипДвижения = ТипДвижения;
    Движение.ДлительностьПосещения = ДлительностьПосещения;
    Движение.Пропуск = Пропуск; // Добавляем пропуск в движение
КонецПроцедуры
